app/controllers/parents_controller.rb

SELECT "parents".* FROM "parents"
---
  def index
    @parents = Parent.all

INSERT INTO "parents" ("name", "email", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mercedes"], ["email", "ty18881@yahoo.com"], ["created_at", "2020-05-20 22:46:32.956352"], ["updated_at", "2020-05-20 22:46:32.956352"], ["user_id", 3]]
---
  def create
    @parent = Parent.new(parent_params)

    if @parent.save