app/controllers/progressreports_controller.rb

  def create
    # this will save the progress report and corresponding game at the same time.
    # @progressreport = Progressreport.new(progressreport_params)

    @progressreport = Progressreport.new
    @progressreport.date = params[:progressreport][:date]
    @progressreport.time_earned = params[:progressreport][:time_earned]
    @progressreport.user_id = params[:progressreport][:user_id]


    if @progressreport.save
      # now it is save to create the underlying game object in the database
      puts 'Progress Report Saved - Now saving the game.'
      @game = Game.new
      @game.date = params[:progressreport][:date]
      @game.num_correct = params[:progressreport][:num_correct]
      @game.num_wrong = params[:progressreport][:num_wrong]
      @game.status ='complete'
      @game.progressreport_id = @progressreport.id

      if @game.save
---
INSERT INTO "progressreports" ("date", "time_earned", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-19"], ["time_earned", 15], ["created_at", "2020-05-20 01:09:43.539189"], ["updated_at", "2020-05-20 01:09:43.539189"], ["user_id", 1]]
INSERT INTO "games" ("date", "status", "created_at", "updated_at", "progressreport_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-23"], ["status", "complete"], ["created_at", "2020-05-23 14:46:27.326252"], ["updated_at", "2020-05-23 14:46:27.326252"], ["progressreport_id", 5]]

    def set_progressreport
      @progressreport = Progressreport.find(params[:id])
---
SELECT "progressreports".* FROM "progressreports" WHERE "progressreports"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]