app/controllers/progressreports_controller.rb

    def set_progressreport
      @progressreport = Progressreport.find(params[:id])
---
SELECT "progressreports".* FROM "progressreports" WHERE "progressreports"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]