app/controllers/users_controller.rb

  def create
    # @user = User.new(user_params)
    @user = User.new

    @user.name = params[:user][:name]
    @user.age = params[:user][:age]
    @user.daily_goal = 30
    @user.time_eligible=false

    if @user.save

      # successfully saved the user, now save the companion record

      @parent = Parent.new
      @parent.name = params[:parentName]
      @parent.email = params[:parentEmail]
      @parent.user_id = @user.id

      puts 'Echo the parent information before we try to save'
      puts @parent.name
      puts @parent.email


      if @parent.save
---
INSERT INTO "users" ("name", "age", "daily_goal", "time_eligible", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tara"], ["age", 17], ["daily_goal", 30], ["time_eligible", false], ["created_at", "2020-05-24 17:43:27.954507"], ["updated_at", "2020-05-24 17:43:27.954507"]]
INSERT INTO "parents" ("name", "email", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "p5"], ["email", "p5@p5.net"], ["created_at", "2020-05-24 18:46:36.218884"], ["updated_at", "2020-05-24 18:46:36.218884"], ["user_id", 19]]